Alexander-Garist/test_stm32f407/IAR_EW_projects/exti.c
/**
  * @file    exti.c
  * @brief   Файл содержит реализации функций EXTI
  */

/** Includes ******************************************************************/
#include "exti.h"
#include "CMSIS/stm32f4xx.h"

/********************** Статические функции ***********************************/

	/**
	! Статическая функция EXTI_InitPin включает тактирование внешних прерываний
		и конфигурирует обработку внешних прерываний на выбранном выводе
		с использованием заданного триггера.
	- port - порт GPIO, на котором будут обрабатываться внешние прерывания
	- pin - пин GPIO, на котором будут обрабатываться внешние прерывания
	- trigger - маска триггера, вызывающего внешнее прерывание
	*/
static void EXTI_InitPin(EXTI_Port port, uint32_t pin, uint32_t trigger)
{
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;	// Включение тактирования

	/** Выбор конкретного регистра EXTICR(0,1,2,3)
		Пины 0,1,2,3 определяются регистром EXTICR[0]
		Пины 4,5,6,7 определяются регистром EXTICR[1]
		Пины 8,9,10,11 определяются регистром EXTICR[2]
		Пины 12,13,14,15 определяются регистром EXTICR[3]
	*/
	uint32_t EXTI_CR_INDEX = pin / 4;

	/** Конкретный бит в регистре
		Определение порта, на котором будут обрабатываться внешние прерывания (A, B, C и т.д.)
		например порт D (0x03): вместо #define SYSCFG_EXTICR2_EXTI5_PD  ((uint16_t)0x0030) // PD[5] pin
		пин 5: (5 % 4)*4 = 4, значит  0x03 сдвиг на 4 позиции влево, получается 0x30
	*/
	uint32_t EXTI_CR_POSITION = (pin % 4) * 4;

    SYSCFG->EXTICR[EXTI_CR_INDEX] &= ~(0xF << EXTI_CR_POSITION);    // Начальное обнуление всех битов
    SYSCFG->EXTICR[EXTI_CR_INDEX] |= (port << EXTI_CR_POSITION);	// Установка значения регистра EXTICR[x]

	// Начальное обнуление регистров триггеров
    EXTI->RTSR &= ~(0x1 << pin);
    EXTI->FTSR &= ~(0x1 << pin);

	// Установка триггера
    if(trigger & EXTI_TRIGGER_RISING) EXTI->RTSR |= (0x1 << pin);
    if(trigger & EXTI_TRIGGER_FALLING) EXTI->FTSR |= (0x1 << pin);

	//Начальное обнуление регистра ожидания
    EXTI->PR = (1 << pin);
}

	/**
	! Статическая функция EXTI_EnableIRQ разрешает обработку внешних прерываний
		на выбранном выводе.
	- pin - пин GPIO, на котором будут обрабатываться внешние прерывания
	*/
static void EXTI_EnableIRQ(uint32_t pin)
{
    EXTI->IMR |= (1 << pin);

    switch(pin) {
        case 0:
            NVIC_EnableIRQ(EXTI0_IRQn);
            break;
        case 1:
            NVIC_EnableIRQ(EXTI1_IRQn);
            break;
        case 2:
            NVIC_EnableIRQ(EXTI2_IRQn);
            break;
        case 3:
            NVIC_EnableIRQ(EXTI3_IRQn);
            break;
        case 4:
            NVIC_EnableIRQ(EXTI4_IRQn);
            break;
        case 5:
        case 6:
        case 7:
        case 8:
        case 9:
            NVIC_EnableIRQ(EXTI9_5_IRQn);
            break;
        case 10:
        case 11:
        case 12:
        case 13:
        case 14:
        case 15:
            NVIC_EnableIRQ(EXTI15_10_IRQn);
            break;
    }
}

	/**
	! Статическая функция EXTI_DisableIRQ запрещает обработку внешних прерываний
		на выбранном выводе.
	- pin - пин GPIO, на котором будет запрещена обработка внешних прерываний
	*/
static void EXTI_DisableIRQ(uint32_t pin)
{
    EXTI->IMR &= ~(1 << pin);

    switch(pin) {
        case 0:
            NVIC_DisableIRQ(EXTI0_IRQn);
            break;
        case 1:
            NVIC_DisableIRQ(EXTI1_IRQn);
            break;
        case 2:
            NVIC_DisableIRQ(EXTI2_IRQn);
            break;
        case 3:
            NVIC_DisableIRQ(EXTI3_IRQn);
            break;
        case 4:
            NVIC_DisableIRQ(EXTI4_IRQn);
            break;
        case 5:
        case 6:
        case 7:
        case 8:
        case 9:
            NVIC_DisableIRQ(EXTI9_5_IRQn);
            break;
        case 10:
        case 11:
        case 12:
        case 13:
        case 14:
        case 15:
            NVIC_DisableIRQ(EXTI15_10_IRQn);
            break;
    }
}

/*********************** Глобальные функции ***********************************/

	/**
	! Функция EXTI_Enable_Pin включает обработку внешних прерываний на выбранном
		пине и задает триггер, который будет вызывать прерывание.
	- port - порт GPIO
	- pin - пин GPIO
	- trigger - триггер, вызывающий прерывание
	*/
void EXTI_Enable_Pin(EXTI_Port port, uint32_t pin, uint32_t trigger)
{
    EXTI_InitPin(port, pin, trigger);
    EXTI_EnableIRQ(pin);
}

	/**
	! Функция EXTI_Disable_Pin выключает обработку внешних прерываний на
		выбранном пине.
	- port - порт GPIO
	- pin - пин GPIO
	*/
void EXTI_Disable_Pin(EXTI_Port port, uint32_t pin)
{
    EXTI_InitPin(port, pin, 0x0);
    EXTI_DisableIRQ(pin);
}

/**
	! Функция EXTI_Clear_Flag сбрасывает флаг ожидания на выбранном пине.
		Функция вызывается в обработчиках внешних прерываний.
	- pin - пин GPIO
*/
void EXTI_Clear_Flag(uint32_t pin)
{
    EXTI->PR = (1 << pin);
}